# Pandas Overview

In [5]:
import numpy as np
import pandas as pd

### Basic Series

In [6]:
my_series = pd.Series([1, 4, 5, 7, np.nan, 8, 9])
my_series

0    1.0
1    4.0
2    5.0
3    7.0
4    NaN
5    8.0
6    9.0
dtype: float64

### Date Time Object

In [9]:
my_date_index = pd.date_range('20170101', periods = 6, freq = 'D')
my_date_index

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

### Sample NumPy Data

In [8]:
sample_numpy_data = np.array(np.arange(24)).reshape((6,4))
sample_numpy_data

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

### Sample DataFrame

In [10]:
sample_df = pd.DataFrame(sample_numpy_data, index = my_date_index, columns  = list('ABCD'))
sample_df

             A   B   C   D
2017-01-01   0   1   2   3
2017-01-02   4   5   6   7
2017-01-03   8   9  10  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

### Data Frame from Python Dictionary

In [11]:
sample_df.head()

             A   B   C   D
2017-01-01   0   1   2   3
2017-01-02   4   5   6   7
2017-01-03   8   9  10  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19

In [12]:
sample_df.tail(2)

             A   B   C   D
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

In [14]:
sample_df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [15]:
sample_df.index

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
sample_df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
sample_df.describe()

               A          B          C          D
count   6.000000   6.000000   6.000000   6.000000
mean   10.000000  11.000000  12.000000  13.000000
std     7.483315   7.483315   7.483315   7.483315
min     0.000000   1.000000   2.000000   3.000000
25%     5.000000   6.000000   7.000000   8.000000
50%    10.000000  11.000000  12.000000  13.000000
75%    15.000000  16.000000  17.000000  18.000000
max    20.000000  21.000000  22.000000  23.000000

In [19]:
pd.set_option('display.precision', 2)

In [20]:
sample_df.describe()

           A      B      C      D
count   6.00   6.00   6.00   6.00
mean   10.00  11.00  12.00  13.00
std     7.48   7.48   7.48   7.48
min     0.00   1.00   2.00   3.00
25%     5.00   6.00   7.00   8.00
50%    10.00  11.00  12.00  13.00
75%    15.00  16.00  17.00  18.00
max    20.00  21.00  22.00  23.00

In [21]:
sample_df.T

   2017-01-01  2017-01-02  2017-01-03  2017-01-04  2017-01-05  2017-01-06
A           0           4           8          12          16          20
B           1           5           9          13          17          21
C           2           6          10          14          18          22
D           3           7          11          15          19          23

In [22]:
sample_df.sort_index(axis = 1, ascending = False)

             D   C   B   A
2017-01-01   3   2   1   0
2017-01-02   7   6   5   4
2017-01-03  11  10   9   8
2017-01-04  15  14  13  12
2017-01-05  19  18  17  16
2017-01-06  23  22  21  20

In [23]:
sample_df.sort_index(axis = 0, ascending = False)

             A   B   C   D
2017-01-06  20  21  22  23
2017-01-05  16  17  18  19
2017-01-04  12  13  14  15
2017-01-03   8   9  10  11
2017-01-02   4   5   6   7
2017-01-01   0   1   2   3

In [24]:
sample_df.sort_values(by='B', ascending = False)

             A   B   C   D
2017-01-06  20  21  22  23
2017-01-05  16  17  18  19
2017-01-04  12  13  14  15
2017-01-03   8   9  10  11
2017-01-02   4   5   6   7
2017-01-01   0   1   2   3

# Selection

Selecting data from DataFrame

In [25]:
sample_df

             A   B   C   D
2017-01-01   0   1   2   3
2017-01-02   4   5   6   7
2017-01-03   8   9  10  11
2017-01-04  12  13  14  15
2017-01-05  16  17  18  19
2017-01-06  20  21  22  23

In [26]:
sample_df['C']

2017-01-01     2
2017-01-02     6
2017-01-03    10
2017-01-04    14
2017-01-05    18
2017-01-06    22
Freq: D, Name: C, dtype: int64

In [27]:
sample_df[1:4]

             A   B   C   D
2017-01-02   4   5   6   7
2017-01-03   8   9  10  11
2017-01-04  12  13  14  15

In [29]:
sample_df.loc[my_date_index[1:3]]

            A  B   C   D
2017-01-02  4  5   6   7
2017-01-03  8  9  10  11

In [30]:
sample_df.loc[:, ['A', 'B']]

             A   B
2017-01-01   0   1
2017-01-02   4   5
2017-01-03   8   9
2017-01-04  12  13
2017-01-05  16  17
2017-01-06  20  21

In [32]:
sample_df.loc[:, ['A', 'B']] * 6

              A    B
2017-01-01    0    6
2017-01-02   24   30
2017-01-03   48   54
2017-01-04   72   78
2017-01-05   96  102
2017-01-06  120  126

In [34]:
sample_df.iloc[3]

A    12
B    13
C    14
D    15
Name: 2017-01-04 00:00:00, dtype: int64

In [35]:
sample_df.iloc[1:3, 2:5]

             C   D
2017-01-02   6   7
2017-01-03  10  11

In [36]:
sample_df.C >= 14

2017-01-01    False
2017-01-02    False
2017-01-03    False
2017-01-04     True
2017-01-05     True
2017-01-06     True
Freq: D, Name: C, dtype: bool

In [37]:
sample_df[sample_df >= 11]

               A     B     C     D
2017-01-01   NaN   NaN   NaN   NaN
2017-01-02   NaN   NaN   NaN   NaN
2017-01-03   NaN   NaN   NaN  11.0
2017-01-04  12.0  13.0  14.0  15.0
2017-01-05  16.0  17.0  18.0  19.0
2017-01-06  20.0  21.0  22.0  23.0